#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
data=[]
x = [1,2,3,4]
y = 'a,b,c,d'
record = dict(zip(x, y.split(',')))
print(record)
data.append(record)
print(data)